app/controllers/networks_controller.rb

SELECT "networks".* FROM "networks"
---
  def index
    @networks = Network.all

INSERT INTO "networks" ("bus_id", "station_id", "bandwidth", "created_at", "updated_at", "five_g") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bus_id", 1], ["station_id", 3], ["bandwidth", "500"], ["created_at", "2019-10-06 03:21:41.830654"], ["updated_at", "2019-10-06 03:21:41.830654"], ["five_g", true]]
---
  def create
    @network = Network.new(network_params)

    respond_to do |format|
      if @network.save

SELECT "networks".* FROM "networks" WHERE "networks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_network
      @network = Network.find(params[:id])